let a = 10 // объявление переменной a  и присваивание ей значения 10

a = 20 /* присваивание нового значения переменной a, которая была объявлена ранее
(новое значение число 20) */

let b // объявление переменной b

/* присваивание значения переменной происходит не сразу, а позже. 
значение переменной b будет undefined, так как переменная объявлена, 
но никакого значения ей не присвоено */

b = false // присваивание переменной b значения false 


console.log(a,b)


const c = 10 // присваивание значения 10 переменной c
c = 20 // нельзя менять значение переменной типа const, в консоли будет ошибка


